MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l13/thirdparty/mspm0l13/ti/devices/msp/peripherals/hw_usb.h
/* USB_CSR0L Bits */
/* USB_CSR0L[RXRDY] Bits */
#define USB_CSR0L_RXRDY_OFS                      (0)                             /* !< RXRDY Offset */
#define USB_CSR0L_RXRDY_MASK                     ((uint8_t)0x00000001U)          /* !< Receive Packet Ready. Device mode:
                                                                                    This bit is set when a data packet
                                                                                    has been received. An interrupt is
                                                                                    generated when this bit is set. The
                                                                                    CPU clears this bit by setting the
                                                                                    RXRDYC_STATUS bit. Host mode:
                                                                                    Software must clear this bit after he
                                                                                    packet has been read from the FIFO to
                                                                                    acknowledge that the data has been
                                                                                    read from the FIFO. */
#define USB_CSR0L_RXRDY_NO_PACKET                ((uint8_t)0x00000000U)          /* !< No receive packet has been
                                                                                    received. */
#define USB_CSR0L_RXRDY_RECV                     ((uint8_t)0x00000001U)          /* !< Indicates that a data packet has
                                                                                    been received in the RX FIFO. The EP0
                                                                                    bit in the USBTXIS register is also
                                                                                    set in this situation. */
/* USB_CSR0L[TXRDY] Bits */
#define USB_CSR0L_TXRDY_OFS                      (1)                             /* !< TXRDY Offset */
#define USB_CSR0L_TXRDY_MASK                     ((uint8_t)0x00000002U)          /* !< Transmit Packet Ready. Device &
                                                                                    Host mode: The CPU sets this bit
                                                                                    after loading a data packet into the
                                                                                    FIFO. It is cleared automatically
                                                                                    when a data packet has been
                                                                                    transmitted. An interrupt is also
                                                                                    generated at this point (if enabled).
                                                                                    Host mode: If both the TXRDY and
                                                                                    DATAEND_SETUP bits are set, a setup
                                                                                    packet is sent. If just TXRDY is set,
                                                                                    an OUT packet is sent. */
#define USB_CSR0L_TXRDY_WAIT                     ((uint8_t)0x00000000U)          /* !< No transmit packet is ready. */
#define USB_CSR0L_TXRDY_READY                    ((uint8_t)0x00000002U)          /* !< Software sets this bit after
                                                                                    loading a data packet into the TX
                                                                                    FIFO. The EP0 bit in the USBTXIS
                                                                                    register is also set in this
                                                                                    situation. */
/* USB_CSR0L[STALLED] Bits */
#define USB_CSR0L_STALLED_OFS                    (2)                             /* !< STALLED Offset */
#define USB_CSR0L_STALLED_MASK                   ((uint8_t)0x00000004U)          /* !< Sent Stall / Receive Stall  Device
                                                                                    mode: This bit is set when a STALL
                                                                                    handshake is transmitted. The CPU
                                                                                    should clear this bit. Host mode:
                                                                                    This bit is set when a STALL
                                                                                    handshake is received. The CPU should
                                                                                    clear this bit. */
#define USB_CSR0L_STALLED_NO_HANDSHAKE           ((uint8_t)0x00000000U)          /* !< No handshake has been received. */
#define USB_CSR0L_STALLED_HANDSHAKE              ((uint8_t)0x00000004U)          /* !< A STALL handshake has been received
                                                                                    or transmitted */
/* USB_CSR0L[DATAEND_SETUP] Bits */
#define USB_CSR0L_DATAEND_SETUP_OFS              (3)                             /* !< DATAEND_SETUP Offset */
#define USB_CSR0L_DATAEND_SETUP_MASK             ((uint8_t)0x00000008U)          /* !< Data end / Setup Packet. Device
                                                                                    mode: Data end bit. The CPU sets this
                                                                                    bit:  1. When setting TXRDY for the
                                                                                    last data packet. 2. When clearing
                                                                                    RXRDY after unloading the last data
                                                                                    packet. 3. When setting TXRDY for a
                                                                                    zero length data packet. Host mode:
                                                                                    Setup packet. The CPU sets this bit,
                                                                                    at the same time as the TXRDY bit is
                                                                                    set, to send a SETUP token instead of
                                                                                    an OUT token for the transaction.
                                                                                    Note: Setting this bit always clears
                                                                                    the DT bit in the USBCSRH0 register. */
#define USB_CSR0L_DATAEND_SETUP_EFFECT           ((uint8_t)0x00000000U)          /* !< No effect */
/* USB_CSR0L[SETEND_ERROR] Bits */
#define USB_CSR0L_SETEND_ERROR_OFS               (4)                             /* !< SETEND_ERROR Offset */
#define USB_CSR0L_SETEND_ERROR_MASK              ((uint8_t)0x00000010U)          /* !< Setup end / Error. Device mode:
                                                                                    Setup end. This bit will be set when
                                                                                    a control transaction ends before the
                                                                                    DATAEND_SETUP bit has been set. An
                                                                                    interrupt will be generated and the
                                                                                    FIFO flushed at this time. The bit is
                                                                                    cleared by the CPU writing a 1 to the
                                                                                    SETENDC_NAKTO bit. Host mode: Error
                                                                                    indication. This bit will be set when
                                                                                    three attempts have been made to
                                                                                    perform a transaction with no
                                                                                    response from the peripheral. The CPU
                                                                                    should clear this bit. An interrupt
                                                                                    is generated when this bit is set. */
#define USB_CSR0L_SETEND_ERROR_NO_EFFECT         ((uint8_t)0x00000000U)          /* !< Clear Error. Note: Only effective
                                                                                    in host mode. */
#define USB_CSR0L_SETEND_ERROR_EFFECT            ((uint8_t)0x00000010U)          /* !< Setup end / Error indication. */
/* USB_CSR0L[STALL_RQPKT] Bits */
#define USB_CSR0L_STALL_RQPKT_OFS                (5)                             /* !< STALL_RQPKT Offset */
#define USB_CSR0L_STALL_RQPKT_MASK               ((uint8_t)0x00000020U)          /* !< Send Stall / Request Packet. Device
                                                                                    mode: The CPU writes a 1 to this bit
                                                                                    to terminate the current transaction.
                                                                                    The STALL handshake will be
                                                                                    transmitted and then this bit will be
                                                                                    cleared automatically. Host mode: The
                                                                                    CPU sets this bit to request an IN
                                                                                    transaction. It is cleared when RXRDY
                                                                                    bit is set. */
#define USB_CSR0L_STALL_RQPKT_NO_EFFECT          ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_CSR0L_STALL_RQPKT_EFFECT             ((uint8_t)0x00000020U)          /* !< Send stall request or request
                                                                                    packet is in effect. */
/* USB_CSR0L[RXRDYC_STATUS] Bits */
#define USB_CSR0L_RXRDYC_STATUS_OFS              (6)                             /* !< RXRDYC_STATUS Offset */
#define USB_CSR0L_RXRDYC_STATUS_MASK             ((uint8_t)0x00000040U)          /* !< Receive ready clear / Status packet
                                                                                    Device mode: Receive ready clear. The
                                                                                    CPU writes a 1 to this bit to clear
                                                                                    the RXRDY bit. It is cleared
                                                                                    automatically Host mode: Status
                                                                                    Packet. The CPU sets this bit at the
                                                                                    same time as the TXRDY or STALL_RQPKT
                                                                                    bit is set, to perform a status stage
                                                                                    transaction. Setting this bit ensures
                                                                                    that the DT bit is set in the
                                                                                    USBCSRH0 register, so that a DATA1
                                                                                    packet is used for the Status Stage
                                                                                    transaction.  Setting this bit
                                                                                    ensures that the DT bit is set in the
                                                                                    USBCSRH0 register so that a DATA1
                                                                                    packet is used for the STATUS stage
                                                                                    transaction. */
#define USB_CSR0L_RXRDYC_STATUS_NO_EFFECT        ((uint8_t)0x00000000U)          /* !< No transaction */
#define USB_CSR0L_RXRDYC_STATUS_EFFECT           ((uint8_t)0x00000040U)          /* !< Clear RXRDY or sent status packet. */
/* USB_CSR0L[SETENDC_NAKTO] Bits */
#define USB_CSR0L_SETENDC_NAKTO_OFS              (7)                             /* !< SETENDC_NAKTO Offset */
#define USB_CSR0L_SETENDC_NAKTO_MASK             ((uint8_t)0x00000080U)          /* !< Setup End Clear / NAK Timeout
                                                                                    Device mode: The CPU writes a 1 to
                                                                                    this bit to clear the SETEND_ERROR
                                                                                    bit. It is cleared automatically.
                                                                                    Host mode: This bit will be set when
                                                                                    Endpoint 0 is halted following the
                                                                                    receipt of NAK responses for longer
                                                                                    than the time set by the USBNAKLMT
                                                                                    register. The CPU should clear this
                                                                                    bit to allow the endpoint to
                                                                                    continue. */
#define USB_CSR0L_SETENDC_NAKTO_NO_EFFECT        ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_CSR0L_SETENDC_NAKTO_EFFECT           ((uint8_t)0x00000080U)          /* !< Clear SETEND_ERROR or SETENDC_KAKTO */

